wayne-love/sn_esp32/src/main.cpp
  SpaAdConfig spa;
  spa.spaName = spaName;
  spa.spaSerialNumber = spaSerialNumber;
  spa.stateTopic = mqttStatusTopic;
  spa.availabilityTopic = mqttAvailability;

  //sensorADPublish("Water Temperature","","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.water }}","measurement","WaterTemperature", spaName, spaSerialNumber);
  //sensorADPublish("Heater Temperature","diagnostic","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.heater }}","measurement","HeaterTemperature", spaName, spaSerialNumber);
  //sensorADPublish("Case Temperature","diagnostic","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.case }}","measurement","CaseTemperature", spaName, spaSerialNumber);
  //sensorADPublish("Mains Voltage","diagnostic","voltage",mqttStatusTopic,"V","{{ value_json.power.voltage }}","measurement","MainsVoltage", spaName, spaSerialNumber);
  //sensorADPublish("Mains Current","diagnostic","current",mqttStatusTopic,"A","{{ value_json.power.current }}","measurement","MainsCurrent", spaName, spaSerialNumber);
  //sensorADPublish("Power","","energy",mqttStatusTopic,"W","{{ value_json.power.energy }}","measurement","Power", spaName, spaSerialNumber);
  //sensorADPublish("Total Energy","","energy",mqttStatusTopic,"Wh","{{ value_json.totalenergy }}","total_increasing","TotalEnergy", spaName, spaSerialNumber);
  //sensorADPublish("Heatpump Ambient Temperature","","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.heatpumpAmbient }}","measurement","HPAmbTemp", spaName, spaSerialNumber);
  //sensorADPublish("Heatpump Condensor Temperature","","temperature",mqttStatusTopic,"°C","{{ value_json.temperatures.heatpumpCondensor }}","measurement","HPCondTemp", spaName, spaSerialNumber);
  //sensorADPublish("State","","",mqttStatusTopic,"","{{ value_json.status.state }}","","State", spaName, spaSerialNumber);
  spa.commandTopic = mqttSet;
  
  SensorAdConfig sensorConfig;

  sensorConfig.displayName = "Water Temperature";
  sensorConfig.valueTemplate = "{{ value_json.temperatures.water }}";
  sensorConfig.propertyId = "WaterTemperature";
  sensorConfig.deviceClass = "temperature";
  sensorConfig.entityCategory = "";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "°C";
  generateAdJSON(output, sensorConfig, spa, discoveryTopic, "sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Case Temperature";
  sensorConfig.valueTemplate = "{{ value_json.temperatures.case }}";
  sensorConfig.propertyId = "CaseTemperature";
  sensorConfig.deviceClass = "temperature";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "°C";
  generateAdJSON(output, sensorConfig, spa, discoveryTopic, "sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Heater Temperature";
  sensorConfig.valueTemplate = "{{ value_json.temperatures.heater }}";
  sensorConfig.propertyId = "HeaterTemperature";
  sensorConfig.deviceClass = "temperature";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "°C";
  generateAdJSON(output, sensorConfig, spa, discoveryTopic, "sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Heatpump Ambient Temperature";
  sensorConfig.valueTemplate = "{{ value_json.temperatures.heatpumpAmbient }}";
  sensorConfig.propertyId = "HPAmbTemp";
  sensorConfig.deviceClass = "temperature";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "°C";
  generateAdJSON(output, sensorConfig, spa, discoveryTopic, "sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Heatpump Condensor Temperature";
  sensorConfig.valueTemplate = "{{ value_json.temperatures.heatpumpCondensor }}";
  sensorConfig.propertyId = "HPCondTemp";
  sensorConfig.deviceClass = "temperature";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "°C";
  generateAdJSON(output, sensorConfig, spa, discoveryTopic, "sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Mains Voltage";
  sensorConfig.valueTemplate = "{{ value_json.power.voltage }}";
  sensorConfig.propertyId = "MainsVoltage";
  sensorConfig.deviceClass = "voltage";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "V";
  generateAdJSON(output, sensorConfig, spa, discoveryTopic, "sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Mains Current";
  sensorConfig.valueTemplate = "{{ value_json.power.current }}";
  sensorConfig.propertyId = "MainsCurrent";
  sensorConfig.deviceClass = "current";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "A";
  generateAdJSON(output, sensorConfig, spa, discoveryTopic, "sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Power";
  sensorConfig.valueTemplate = "{{ value_json.power.power }}";
  sensorConfig.propertyId = "Power";
  sensorConfig.deviceClass = "power";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "W";
  generateAdJSON(output, sensorConfig, spa, discoveryTopic, "sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "Total Energy";
  sensorConfig.valueTemplate = "{{ value_json.power.totalEnergy }}";
  sensorConfig.propertyId = "TotalEnergy";
  sensorConfig.deviceClass = "energy";
  sensorConfig.entityCategory = "diagnostic";
  sensorConfig.stateClass = "measurement";
  sensorConfig.unitOfMeasure = "kWh";
  generateAdJSON(output, sensorConfig, spa, discoveryTopic, "sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  sensorConfig.displayName = "State";
  sensorConfig.valueTemplate = "{{ value_json.status.state }}";
  sensorConfig.propertyId = "State";
  sensorConfig.deviceClass = "";
  sensorConfig.entityCategory = "";
  sensorConfig.stateClass = "";
  sensorConfig.unitOfMeasure = "";
  generateAdJSON(output, sensorConfig, spa, discoveryTopic, "sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  //binarySensorADPublish("Heating Active","",mqttStatusTopic,"{{ value_json.status.heatingActive }}","HeatingActive", spaName, spaSerialNumber);
  //binarySensorADPublish("Ozone Active","",mqttStatusTopic,"{{ value_json.status.ozoneActive }}","OzoneActive", spaName, spaSerialNumber);

  BinarySensorAdConfig binaryConfig;

  binaryConfig.displayName = "Heating Active";
  binaryConfig.valueTemplate = "{{ value_json.status.heatingActive }}";
  binaryConfig.propertyId = "HeatingActive";
  binaryConfig.deviceClass = "heat";
  generateAdJSON(output, binaryConfig, spa, discoveryTopic, "binary_sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  binaryConfig.displayName = "Ozone Active";
  binaryConfig.valueTemplate = "{{ value_json.status.ozoneActive }}";
  binaryConfig.propertyId = "OzoneActive";
  binaryConfig.deviceClass = "running";
  generateAdJSON(output, binaryConfig, spa, discoveryTopic, "binary_sensor");

  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  climateADPublish(mqttClient, spa, spaName, "{{ value_json.temperatures }}", "Heating");
  selectADPublish(mqttClient, spa, "Heatpump Mode", "{{ value_json.heatpump.mode }}", "heatpump_mode", "", "", {"Auto","Heat","Cool","Off"});

  if (si.getPump1InstallState().startsWith("1") && !(si.getPump1InstallState().endsWith("4"))) {
     switchADPublish(mqttClient, spa, "Pump 1", "{{ value_json.pumps.pump1.state }}", "pump1");
  }

  if (si.getPump2InstallState().startsWith("1") && !(si.getPump2InstallState().endsWith("4"))) {
    switchADPublish(mqttClient, spa, "Pump 2","{{ value_json.pumps.pump2.state }}", "pump2");
  }

  if (si.getPump3InstallState().startsWith("1") && !(si.getPump3InstallState().endsWith("4"))) {
    switchADPublish(mqttClient, spa, "Pump 3", "{{ value_json.pumps.pump3.state }}", "pump3");
  }

  if (si.getPump4InstallState().startsWith("1") && !(si.getPump4InstallState().endsWith("4"))) {
    switchADPublish(mqttClient, spa, "Pump 4", "{{ value_json.pumps.pump4.state }}", "pump4");
  }

  if (si.getPump5InstallState().startsWith("1") && !(si.getPump5InstallState().endsWith("4"))) {
    switchADPublish(mqttClient, spa, "Pump 5", "{{ value_json.pumps.pump5.state }}", "pump5");
  }

